{
  //True to enable automatic backups in intervals.  False to disable. [default = true]
  //In single player, only backs up if the game is not paused.
  "enableAutomaticBackups": true,
  //Delay in seconds between automatic backups. [default = 3600] [minimum = 10]
  "backupIntervalInSeconds": 3600,
  //Only backup if players were online for the backup interval. [default = true]
  //You might want to set this to false if the server is loading chunks even when no one is online.
  "onlyBackupIfPlayersOnline": true,
  //True to trigger a backup when server is stopped.  False to disable [default = true]
  //If backup takes longer than max-tick-time set in server.properties, the server thread will wait until backup finishes.
  //Note: this may not properly finish the backup if you try to terminate the process with an interruption
  //	such as CTRL+C!  Double check the backup file is the size you expect
  "enableServerStoppedBackup": true,
  //Backup format.  Supports simply backing up as a direct copy of the folder, or ZIP [default = "ZIP"]
  //Supported formats: "DIRECTORY", "ZIP", "LZ4"
  //	DIRECTORY: copies the world folder as-is
  //	ZIP: copies the world folder and zips it into a .zip file
  //	LZ4: archives the world folder into a .tar, then compresses using lz4, making a .tar.lz4 file
  //LZ4 can be extracted/decompressed using 7-Zip-zstd: https://github.com/mcmilk/7-Zip-zstd
  //See https://github.com/spoorn/SimpleBackup/blob/main/README.md for more information on the backup formats
  "backupFormat": "ZIP",
  //Number of threads to execute backup.  Allows for parallel compression.  Only applies for LZ4 format currently!  [default = 1]
  //Recommend only increasing this value if your world is very large and backups take a while.
  //Recommend setting numThreads for multi-threaded processing to the number of cores in your CPU, or a multiple of that number.
  //This is capped to number of processors * 4 for your safety!
  "numThreads": 1,
  //Buffer size in bytes for multi-threading (when numThreads > 1) used for compressing and merging files [default = 8192]
  "multiThreadBufferSize": 8192,
  //Percentage of disk space available required before creating a backup.  [default = 20]
  //This will prevent generating backups if your disk space is getting close to maxing out.
  "percentageAvailableDiskSpaceRequirement": 20,
  //Backup folder.  If this is set to a relative path, it will be relative to the game directory [default = "backup"]
  //This can be an absolute path as well if you want to store backups in a different location.
  //Note: If you are using backslashes '\' instead of forward slash, you will need to escape it with double backslash '\\'.
  //Examples:
  //	"backupPath": "F:/mybackups/backup",
  //	"backupPath": "F:\\mybackups\\backup",
  "backupPath": "backup",
  //Maximum number of backups to keep at a given time.  [default = 10]
  //If we generate a backup, but have more backups than this number, the oldest backup will be deleted.
  "maxBackupsToKeep": 10,
  //True to enable manual backups, false to disable  [default = true]
  "enableManualBackups": true,
  //Permission level to allow manual backups.  [4 = Ops] [0 = everyone] [default = 4]
  "permissionLevelForManualBackups": 4,
  //True to broadcast across the server when backups are triggered and finished.  False to disable. [default = true]
  "broadcastBackupMessage": true,
  //Percentage (%) interval to log to server console the backup progress.  [default = 10]
  //Set this to a value <= 0 or > 100 to not print anything.
  "intervalPercentageToLogBackupProgress": 10,
  //Broadcast messages when server is backing up and success/failed.  These are in the config file to allow
  //servers to use whatever language they want without updating the mod source directly.  Default language is english
  "broadcastMessages": {
    "simplebackup.backup.failed.broadcast1": "Server failed to backup to ",
    "simplebackup.backup.success.broadcast": "Server was successfully backed up to ",
    "simplebackup.backup.broadcast": "Starting server backup...",
    "simplebackup.backup.failed.broadcast2": ".  Please check the server logs for errors!",
    "simplebackup.manualbackup.disabled": "Manual backups are disabled by the server!",
    "simplebackup.manualbackup.started": " triggered a manual backup",
    "simplebackup.manualbackup.alreadyexists": "There is already an ongoing manual backup.  Please wait for it to finish before starting another!",
    "simplebackup.manualbackup.notallowed": "You don\u0027t have permissions to trigger a manual backup!  Sorry :("
  }
}
